In [2]:
'''
Leaning basic pandas functionalities
    Get familizarized with various pandas methods/functions to retrieve, clean and analyze datasets

Resources:

https://github.com/justmarkham/pandas-videos/blob/master/top_25_pandas_tricks.ipynb
Coursera guide project "processing data with python"
'''

'\nLeaning basic pandas functionalities\n    Get familizarized with various pandas methods/functions to retrieve, clean and analyze datasets\n\nResources:\n\nhttps://github.com/justmarkham/pandas-videos/blob/master/top_25_pandas_tricks.ipynb\nCoursera guide project "processing data with python"\n'

In [4]:
import pandas as pd
import numpy as np

# To get versions of pandas' dependencies
#pd.__version__
#pd.show_versions()

In [4]:
'''


Read and create dataframe


'''

'\nRead and create dataframe\n'

In [5]:
# Read external csv sources --- haven't figured out how to use this (local csv files) in platforms other than Jupyter
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
movies = pd.read_csv('http://bit.ly/imdbratings')
orders = pd.read_csv('http://bit.ly/chiporders', sep='\t')
orders['item_price'] = orders.item_price.str.replace('$', '').astype('float')
stocks = pd.read_csv('http://bit.ly/smallstocks', parse_dates=['Date'])
titanic = pd.read_csv('http://bit.ly/kaggletrain')
ufo = pd.read_csv('http://bit.ly/uforeports', parse_dates=['Time'])

In [6]:
# Size of the data? How many columns? Data types? etc. What if it is too big?
drinks.info(memory_usage='deep')

cols = ['beer_servings', 'continent']
small_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols) # specify the columns
#small_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    object
dtypes: float64(1), int64(3), object(2)
memory usage: 30.5 KB

In [7]:
# Convert categorical datas to pandas category data type
# https://pandas.pydata.org/pandas-docs/stable/user_guide/categorical.html

dtypes = {'continent':'category'}
smaller_drinks = pd.read_csv('http://bit.ly/drinksbycountry', usecols=cols, dtype=dtypes)
#smaller_drinks.info(memory_usage='deep')

In [8]:
#print (sampledrop.mean(), '\n\n', sampledrop.median(), '\n\n', sampledrop.std())

hello1 = sampledrop['LandAverageTemperature']
hello = sampledrop[['LandAverageTemperature','LandMaxTemperature']]
#print (sampledrop.iloc[3])

#print(sampledrop['LandAverageTemperature'][:3])
#print(sampledrop['LandAverageTemperature'][:3].mean())
#print ('\n\n',hello.mean())

sampleindexed = sample.set_index('LandAverageTemperature')
#print(sampleindexed.loc[11.573])

NameError: name 'sampledrop' is not defined

In [ ]:
df = pd.DataFrame(np.random.rand(4,7), columns=list('abcdefg'))

df.add_prefix('baby_')
df.add_suffix('_haha')

In [ ]:
drinks.head()
drinks.loc[::-1].reset_index(drop=True).head() # drop parameter drops the original indexes of drinks

drinks[drinks.columns[::-1]]
#this is the same as
drinks.iloc[:, ::-1]

In [11]:
# Split up dataframe into subsets (index values have to be unique)
movies_1 = movies.sample(frac=0.75, random_state=1234)

movies_2 = movies.drop(movies_1.index)

movies_1.index.sort_values()

Int64Index([  0,   2,   5,   6,   7,   8,   9,  11,  13,  16,
            ...
            966, 967, 969, 971, 972, 974, 975, 976, 977, 978],
           dtype='int64', length=734)

In [27]:
# Filter the Dataset
movies[(movies.genre=='Action') | (movies.genre=='Crime')].head()
#or
movies[movies.genre.isin(['Action', 'Crime'])]
#Adding a tilde reverses the filter
movies[~movies.genre.isin(['Action', 'Crime'])]

,star_rating,title,content_rating,genre,duration,actors_list
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
6,8.9,"The Good, the Bad and the Ugly",NOT RATED,Western,161,"[u'Clint Eastwood', u'Eli Wallach', u'Lee Van ..."
7,8.9,The Lord of the Rings: The Return of the King,PG-13,Adventure,201,"[u'Elijah Wood', u'Viggo Mortensen', u'Ian McK..."
8,8.9,Schindler's List,R,Biography,195,"[u'Liam Neeson', u'Ralph Fiennes', u'Ben Kings..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
...,...,...,...,...,...,...
972,7.4,Blue Valentine,NC-17,Drama,112,"[u'Ryan Gosling', u'Michelle Williams', u'John..."
973,7.4,The Cider House Rules,PG-13,Drama,126,"[u'Tobey Maguire', u'Charlize Theron', u'Micha..."
974,7.4,Tootsie,PG,Comedy,116,"[u'Dustin Hoffman', u'Jessica Lange', u'Teri G..."
975,7.4,Back to the Future Part III,PG,Adventure,118,"[u'Michael J. Fox', u'Christopher Lloyd', u'Ma..."
977,7.4,Poltergeist,PG,Horror,114,"[u'JoBeth Williams', u""Heather O'Rourke"", u'Cr..."

In [112]:
movies.genre.unique()
counts = movies.genre.value_counts().nlargest(5) #value_counts returns a series counts of unique values in descending order
movies[movies.genre.isin(counts.nlargest(3).index)].head()

,star_rating,title,content_rating,genre,duration,actors_list
3,9.0,The Dark Knight,PG-13,Action,152,"[u'Christian Bale', u'Heath Ledger', u'Aaron E..."
5,8.9,12 Angry Men,NOT RATED,Drama,96,"[u'Henry Fonda', u'Lee J. Cobb', u'Martin Bals..."
9,8.9,Fight Club,R,Drama,139,"[u'Brad Pitt', u'Edward Norton', u'Helena Bonh..."
11,8.8,Inception,PG-13,Action,148,"[u'Leonardo DiCaprio', u'Joseph Gordon-Levitt'..."
12,8.8,Star Wars: Episode V - The Empire Strikes Back,PG,Action,124,"[u'Mark Hamill', u'Harrison Ford', u'Carrie Fi..."

In [ ]:
'''


Clean up data


'''

In [45]:
sample = pd.read_csv('GlobalTemperatures.csv')
#print(sample.head(5),'\n\n')
samplezeros = sample.fillna(0)
#print (samplezeros)
sampledrop = sample.dropna(0)

ufo.isna().sum()

ufo.dropna(thresh=len(ufo)*0.9, axis='columns').head() # create a threshold for dropna 
                                                    # drop columns if over 90% of the values are missing

,City,Colors Reported,Shape Reported,State,Time
0,Ithaca,NaN,TRIANGLE,NY,1930-06-01 22:00:00
1,Willingboro,NaN,OTHER,NJ,1930-06-30 20:00:00
2,Holyoke,NaN,OVAL,CO,1931-02-15 14:00:00
3,Abilene,NaN,DISK,KS,1931-06-01 13:00:00
4,New York Worlds Fair,NaN,LIGHT,NY,1933-04-18 19:00:00
...,...,...,...,...,...
18236,Grant Park,NaN,TRIANGLE,IL,2000-12-31 23:00:00
18237,Spirit Lake,NaN,DISK,IA,2000-12-31 23:00:00
18238,Eagle River,NaN,NaN,WI,2000-12-31 23:45:00
18239,Eagle River,RED,LIGHT,WI,2000-12-31 23:45:00
18240,Ybor,NaN,OVAL,FL,2000-12-31 23:59:00

In [ ]:
count = 0
for index, row in sample.iterrows():
    if any(row.isnull()):
        count +=1

In [ ]:
drinks.select_dtypes(include='object').head() #include can point to a list of column names in strings
                                              #exclude works opposite from include
drinks.dtypes

In [ ]:
drinks.astype({'wine_servings':'int64'}).dtypes # astype function cast a panda object to a specific dtype

In [ ]:
drinks.apply(pd.to_numeric, errors='ignore') # convert the argument to a numeric type
#try drinks.apply(pd.to_numeric, errors='coerce').fillna(0) -->  the errors parameter turns non# objects into nan

In [13]:
# convert any object columns containing categorical data to the category data type
# more research on the difference between them
smaller_drinks = pd.read_csv('http://bit.ly/drinksbycountry', dtype={'continent':'category'})
smaller_drinks.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 193 entries, 0 to 192
Data columns (total 6 columns):
 #   Column                        Non-Null Count  Dtype
---  ------                        --------------  -----
 0   country                       193 non-null    object
 1   beer_servings                 193 non-null    int64
 2   spirit_servings               193 non-null    int64
 3   wine_servings                 193 non-null    int64
 4   total_litres_of_pure_alcohol  193 non-null    float64
 5   continent                     193 non-null    category
dtypes: category(1), float64(1), int64(3), object(1)
memory usage: 19.2 KB

In [ ]:
'''


Analyze dataset


'''

In [55]:
# split a string into multiple columns
df = pd.DataFrame({'name':['John Arthur Doe', 'Jane Ann Smith'],
                   'location':['Los Angeles, CA', 'Washington, DC']})
df.name.str.split(' ', expand=True) # True to expand the string into separate columns
df[['first','middle','last']]=df.name.str.split(' ', expand=True)

              name         location first  middle   last
0  John Arthur Doe  Los Angeles, CA  John  Arthur    Doe
1   Jane Ann Smith   Washington, DC  Jane     Ann  Smith

In [56]:
#expand a series of lists into dataframe
df = pd.DataFrame({'col_one':['a', 'b', 'c'], 'col_two':[[10, 40], [20, 50], [30, 60]]})
df_new = df.col_two.apply(pd.Series)
pd.concat([df, df_new], axis='columns')

  col_one   col_two   0   1
0       a  [10, 40]  10  40
1       b  [20, 50]  20  50
2       c  [30, 60]  30  60

In [79]:
orders.head(10)
orders[orders.order_id == 1].item_price.sum()

orders.groupby('order_id').item_price.sum().head()

#aggregate multiple functions on the groups by order_id
orders.groupby('order_id').item_price.agg(['sum', 'count'])

# transform performs the same calculation but produces the same number of outputs as the inputs
total_price = orders.groupby('order_id').item_price.transform('sum')

# this makes it possible to calculate percentage of total price
orders['percent_of_total'] = orders.item_price / orders.total_price

pandas.core.series.Series

In [98]:
# numerical summary of the dataset
titanic.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [118]:
# calculate survival rate of a category 

titanic.groupby(['Sex','Pclass']).Survived.mean() # This outputs an multiindexed series

titanic.groupby(['Sex', 'Pclass']).Survived.mean().unstack() # reshape multiindexed series into a dataframe
#or
titanic.pivot_table(index='Sex', columns='Pclass', values='Survived', aggfunc='mean')

Pclass         1         2         3
Sex
female  0.968085  0.921053  0.500000
male    0.368852  0.157407  0.135447

In [123]:
# calculate survival rate of categories in age range
titanic.groupby(['Sex',pd.cut(titanic.Age, bins=[0, 18, 25, 99], labels=['child', 'young adult', 'adult'])]).Survived.mean()

Sex     Age
female  (0, 18]     0.676471
        (18, 25]    0.759259
        (25, 99]    0.791367
male    (0, 18]     0.338028
        (18, 25]    0.120370
        (25, 99]    0.204380
Name: Survived, dtype: float64

In [ ]:
# Change the display options, style dataframes

pd.set_option('display.float_format', '{:.2f}'.format)
pd.reset_option('display.float_format')